mosi=[['A','.-'],['B','-...'],["C", "-.-."],["D", "-.."],["E", "."],["F", "..-."],["G", "--."],["H", "...."],["I", ".."],["J", ".---"],["K", "-.-"],["L", ".-.."],["M", "--"],["N", "-."],["O", "---"],["P", ".--."],["Q", "--.-"],["R", ".-."],["S", "..."],["T", "-"], ["U", "..-"],["V", "...-"],["W", ".--"],["X", "-..-"],["Y", "-.--"],["Z", "--.."],  # Z
]
# 标准摩尔斯电码表（字母部分）


def change(code):
    for i in range(26):
        if mosi[i][1]==code:
            return mosi[i][0]


morse=input('请输入摩斯电码（电码之间用“/”分割）：')
j=0
s=''
for i in range(len(morse)):
    if morse[i]=='/':
        tmp=morse[j:i]
        s=s+change(tmp)
        j=i+1
           #似乎有个小问题，循环结束后i不会保留，
if morse[-1]!='/':
    s=s+change(morse[j:])
print(s)

